% 本算法还未实现。。。 Not realized！！
% ======================================================================================
% 作者： cx
% 时间： 2025-07-28
% 实现： 二进制累加法计算大数相乘, 
% ======================================================================================
function [result] = CumulativeMultiply(num1,num2)
    a=uint8(str2num(num1(:)))';
    b=uint8(str2num(num2(:)))';
    len1=length(a);
    len2=length(b);

    %将b从十进制转二进制，作为标志位

    %实现log2(b)次累加操作,保存为A矩阵

    %按照标志位，将A矩阵中的对应行加起来
    
end